---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.PostEventArgs
source: html/9f403fc4-e152-022f-01e6-52ff6982bb5b.htm
---
# PostEventArgs Properties

Indicates whether the event is being cancelled.
When the event is cancellable, set the property to True to cancel it.